{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/austincoffelt/Documents/bart_fare_gates_project/results/analysis_log_ 8 Sep 2025.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 8 Sep 2025, 20:43:46
{txt}
{com}. 
. 
. **# 2. Load Data
. ******************
. cd "$data" 
{res}/Users/austincoffelt/Documents/bart_fare_gates_project/data
{txt}
{com}. 
. // 2023 Data
. import delimited "date-hour-soo-dest-2023.csv", clear
{res}{txt}(encoding automatically selected: ISO-8859-1)
{text}(5 vars, 8,690,367 obs)

{com}. tempfile file2023
{txt}
{com}. save `file2023'
{txt}{p 0 4 2}
file {bf}
/var/folders/6z/0pv81j2524v8c80qsmnrbmcm0000gn/T//S_50712.000001{rm}
saved
as .dta format
{p_end}

{com}. 
. // 2024 Data  
. import delimited "date-hour-soo-dest-2024.csv", clear
{res}{txt}(encoding automatically selected: ISO-8859-1)
{text}(5 vars, 8,939,603 obs)

{com}. tempfile file2024
{txt}
{com}. save `file2024'
{txt}{p 0 4 2}
file {bf}
/var/folders/6z/0pv81j2524v8c80qsmnrbmcm0000gn/T//S_50712.000002{rm}
saved
as .dta format
{p_end}

{com}. 
. // 2025 Data
. import delimited "date-hour-soo-dest-2025.csv", clear 
{res}{txt}(encoding automatically selected: ISO-8859-1)
{text}(5 vars, 5,376,453 obs)

{com}. tempfile file2025
{txt}
{com}. save `file2025'
{txt}{p 0 4 2}
file {bf}
/var/folders/6z/0pv81j2524v8c80qsmnrbmcm0000gn/T//S_50712.000003{rm}
saved
as .dta format
{p_end}

{com}. 
. // Fare Gates Completion Dates
. import excel "bartCompletionDates.xlsx", clear firstrow
{res}{text}(2 vars, 50 obs)

{com}. rename completionDate completion_date
{res}{txt}
{com}. label variable completion_date "Fare gate completion date"
{txt}
{com}. 
. describe

{txt}Contains data
 Observations:{res}            50                  
{txt}    Variables:{res}             2                  
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:origin         }{txt}{bind: str4    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}origin{p_end}
{p 0 48}{bind:completion_date}{txt}{bind: int     }{bind:%td       }{space 1}{bind:         }{bind:  }{res}{res}Fare gate completion date{p_end}
{txt}{hline}
Sorted by: 
     Note: {res}Dataset has changed since last saved.
{txt}
{com}. 
. tempfile completionDates
{txt}
{com}. save `completionDates'
{txt}{p 0 4 2}
file {bf}
/var/folders/6z/0pv81j2524v8c80qsmnrbmcm0000gn/T//S_50712.000004{rm}
saved
as .dta format
{p_end}

{com}. 
. // Fare Gates Start Date
. import excel "bartStartDates.xlsx", clear firstrow
{res}{text}(2 vars, 50 obs)

{com}. label variable start_date "Fare gate start date"
{txt}
{com}. 
. describe

{txt}Contains data
 Observations:{res}            50                  
{txt}    Variables:{res}             2                  
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:origin         }{txt}{bind: str4    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}origin{p_end}
{p 0 48}{bind:start_date     }{txt}{bind: int     }{bind:%td       }{space 1}{bind:         }{bind:  }{res}{res}Fare gate start date{p_end}
{txt}{hline}
Sorted by: 
     Note: {res}Dataset has changed since last saved.
{txt}
{com}. 
. tempfile startDates
{txt}
{com}. save `startDates'
{txt}{p 0 4 2}
file {bf}
/var/folders/6z/0pv81j2524v8c80qsmnrbmcm0000gn/T//S_50712.000005{rm}
saved
as .dta format
{p_end}

{com}. 
. // BART station descriptive variables
. import excel "bartStationLines.xlsx", clear firstrow
{res}{text}(9 vars, 114 obs)

{com}. 
. label variable station_id "Station ID"
{txt}
{com}. label variable line_color "The line the station is on"
{txt}
{com}. label variable line_order "Where in the line the station falls"
{txt}
{com}. label variable transfer_station "Transfer station"
{txt}
{com}. label variable downtown_core "Downtown San Francisco station"
{txt}
{com}. label variable parking "Parking next to the station"
{txt}
{com}. label variable metro_connection "Connected to Muni Metro"
{txt}
{com}. label variable other_train_connection "Connected to train station"
{txt}
{com}. label variable airport_connection "Connected to airport"
{txt}
{com}. 
. // Sort and prepare for concatenation
. sort station_id line_color
{txt}
{com}. bysort station_id: gen line_num = _n
{txt}
{com}. 
. // Use tostring and replace for concatenation
. tostring line_color line_order, replace
{txt}line_color already string; no {res}replace
{txt}line_order was {res:byte} now {res:str2}

{com}. bysort station_id: gen all_lines = line_color if _n == 1
{txt}(64 missing values generated)

{com}. bysort station_id: replace all_lines = all_lines[_n-1] + "|" + line_color if _n > 1
{txt}(64 real changes made)

{com}. 
. bysort station_id: gen all_line_orders = line_order if _n == 1  
{txt}(64 missing values generated)

{com}. bysort station_id: replace all_line_orders = all_line_orders[_n-1] + "|" + line_order if _n > 1
{txt}(64 real changes made)

{com}. 
. // Keep only one observation per station with the concatenated values
. bysort station_id: keep if _n == _N
{txt}(64 observations deleted)

{com}. 
. // Verify we now have one row per station
. duplicates report station_id

{p 0 4}{txt}Duplicates in terms of {res} station_id{p_end}

{txt}{hline 10}{c TT}{hline 27}
   Copies {c |} Observations       Surplus
{hline 10}{c +}{hline 27}
        1 {c |}           {res}50             0
{txt}{hline 10}{c BT}{hline 27}

{com}. 
. tempfile bartStationLines
{txt}
{com}. save `bartStationLines'
{txt}{p 0 4 2}
file {bf}
/var/folders/6z/0pv81j2524v8c80qsmnrbmcm0000gn/T//S_50712.000006{rm}
saved
as .dta format
{p_end}

{com}. 
. 
. // Append all files together
. use `file2023', clear
{txt}
{com}. append using `file2024'
{txt}
{com}. append using `file2025'
{txt}
{com}. 
. 
. **# 3. Data Cleaning & Preparation
. ***********************************
. // Inspect the data
. describe

{txt}Contains data from {res}/var/folders/6z/0pv81j2524v8c80qsmnrbmcm0000gn/T//S_50712.000001
{txt} Observations:{res}    23,006,423                  
{txt}    Variables:{res}             5                  8 Sep 2025 20:43
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:v1             }{txt}{bind: str10   }{bind:%10s      }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:v2             }{txt}{bind: byte    }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:v3             }{txt}{bind: str4    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:v4             }{txt}{bind: str4    }{bind:%9s       }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:v5             }{txt}{bind: int     }{bind:%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: 
     Note: {res}Dataset has changed since last saved.
{txt}
{com}. summarize

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}v1 {c |}{res}          0
{txt}{space 10}v2 {c |}{res} 23,006,423    13.70576    5.343343          0         23
{txt}{space 10}v3 {c |}{res}          0
{txt}{space 10}v4 {c |}{res}          0
{txt}{space 10}v5 {c |}{res} 23,006,423    5.798801    11.51835          1       1030
{txt}
{com}. 
. // rename variables and label data
. label data "Appended BART Ridership Data 2023-2025"
{txt}
{com}. rename (v1 v2 v3 v4 v5) (date hour origin destination riders)
{res}{txt}
{com}. label variable date "Date"
{txt}
{com}. label variable hour "Hour from 0 to 23"
{txt}
{com}. label variable origin "Starting Station"
{txt}
{com}. label variable destination "Destination Station"
{txt}
{com}. label variable riders "Hourly Riders"
{txt}
{com}. 
. // Change data to daily not hourly
. collapse (sum) riders, by(date origin destination)
{res}{txt}
{com}. 
. // Sort the data for better organization
. sort date origin destination
{txt}
{com}. 
. // Label the variables
. label variable riders "Daily riders from origin to destination"
{txt}
{com}. 
. 
. **# 4. Convert Date to Stata Format & Create Time Variables
. ***********************************************************
. // Convert string date to Stata date format (adjust format if needed)
. gen date_numeric = date(date, "YMD")
{txt}
{com}. format date_numeric %td
{txt}
{com}. drop date
{txt}
{com}. rename date_numeric date
{res}{txt}
{com}. label variable date "Date (Stata format)"
{txt}
{com}. 
. // Create day of week variables
. gen dow = dow(date)
{txt}
{com}. label variable dow "Day of Week (0=Sun, 6=Sat)"
{txt}
{com}. 
. 
. **# 5. Merge with Fare Gate Completion and Start Dates
. ********************************************
. // Prepare station names for merging
. replace origin = upper(trim(origin))
{txt}(0 real changes made)

{com}. replace destination = upper(trim(destination))
{txt}(0 real changes made)

{com}. 
. // Merge completion dates (origin)
. merge m:1 origin using `completionDates', keep(master matched) generate(merge_origin)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}       2,268,553{txt}  (merge_origin==3)
{col 5}{hline 41}

{com}. 
. rename completion_date origin_completion_date
{res}{txt}
{com}. 
. // Check merge results
. drop if merge_origin == 2
{txt}(0 observations deleted)

{com}. drop merge_origin
{txt}
{com}. 
. // Label the existing variable 
. label variable origin_completion_date "Origin station fare gate completion date"
{txt}
{com}. 
. // Merge completion dates (destination)
. preserve
{txt}
{com}. use `completionDates', clear
{txt}
{com}. rename origin destination
{res}{txt}
{com}. save temp_dest_dates, replace
{txt}{p 0 4 2}
(file {bf}
temp_dest_dates.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
temp_dest_dates.dta{rm}
saved
{p_end}

{com}. restore
{txt}
{com}. 
. merge m:1 destination using temp_dest_dates, keep(master matched) generate(merge_destination)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}       2,268,553{txt}  (merge_destination==3)
{col 5}{hline 41}

{com}. rename completion_date destination_completion_date
{res}{txt}
{com}. 
. // Check merge results
. drop if merge_destination == 2
{txt}(0 observations deleted)

{com}. drop merge_destination
{txt}
{com}. 
. // Clean up temporary file
. erase temp_dest_dates.dta
{txt}
{com}. 
. // Label the variable
. label variable destination_completion_date "Destination station fare gate completion date"
{txt}
{com}. 
. // Merge start dates (origin)
. merge m:1 origin using `startDates', keep(master matched) generate(merge_origin)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}       2,268,553{txt}  (merge_origin==3)
{col 5}{hline 41}

{com}. 
. rename start_date origin_start_date
{res}{txt}
{com}. 
. // Check merge results
. drop if merge_origin == 2
{txt}(0 observations deleted)

{com}. drop merge_origin
{txt}
{com}. 
. // Label the existing variable 
. label variable origin_start_date "Origin station fare gate start date"
{txt}
{com}. 
. // Merge start dates (destination)
. preserve
{txt}
{com}. use `startDates', clear
{txt}
{com}. rename origin destination
{res}{txt}
{com}. save temp_dest_dates, replace
{txt}{p 0 4 2}
(file {bf}
temp_dest_dates.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
temp_dest_dates.dta{rm}
saved
{p_end}

{com}. restore
{txt}
{com}. 
. merge m:1 destination using temp_dest_dates, keep(master matched) generate(merge_destination)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}       2,268,553{txt}  (merge_destination==3)
{col 5}{hline 41}

{com}. rename start_date destination_start_date
{res}{txt}
{com}. 
. // Check merge results
. drop if merge_destination == 2
{txt}(0 observations deleted)

{com}. drop merge_destination
{txt}
{com}. 
. // Clean up temporary file
. erase temp_dest_dates.dta
{txt}
{com}. 
. // Label the variable
. label variable destination_start_date "Destination station fare gate start date"
{txt}
{com}. 
. // Merge origin station characteristics
. preserve
{txt}
{com}. use `bartStationLines', clear
{txt}
{com}. rename station_id origin
{res}{txt}
{com}. rename all_lines origin_lines
{res}{txt}
{com}. rename all_line_orders origin_lines_order
{res}{txt}
{com}. rename transfer_station origin_transfer
{res}{txt}
{com}. rename downtown_core origin_downtown
{res}{txt}
{com}. rename parking origin_parking
{res}{txt}
{com}. rename metro_connection origin_metro
{res}{txt}
{com}. rename other_train_connection origin_other_train
{res}{txt}
{com}. rename airport_connection origin_airport
{res}{txt}
{com}. save temp_bart_lines, replace
{txt}{p 0 4 2}
(file {bf}
temp_bart_lines.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
temp_bart_lines.dta{rm}
saved
{p_end}

{com}. restore
{txt}
{com}. 
. merge m:1 origin using temp_bart_lines, keep(master matched) generate(merge_origin)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}       2,268,553{txt}  (merge_origin==3)
{col 5}{hline 41}

{com}. 
. // Check merge results
. drop if merge_origin == 2
{txt}(0 observations deleted)

{com}. drop merge_origin
{txt}
{com}. 
. // Clean up temporary file
. erase temp_bart_lines.dta
{txt}
{com}. 
. // Merge destination station characteristics
. preserve
{txt}
{com}. use `bartStationLines', clear
{txt}
{com}. rename station_id destination
{res}{txt}
{com}. rename all_lines destination_lines
{res}{txt}
{com}. rename all_line_orders destination_lines_order
{res}{txt}
{com}. rename transfer_station destination_transfer
{res}{txt}
{com}. rename downtown_core destination_downtown
{res}{txt}
{com}. rename parking destination_parking
{res}{txt}
{com}. rename metro_connection destination_metro
{res}{txt}
{com}. rename other_train_connection destination_other_train
{res}{txt}
{com}. rename airport_connection destination_airport
{res}{txt}
{com}. save temp_bart_lines, replace
{txt}{p 0 4 2}
(file {bf}
temp_bart_lines.dta{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
temp_bart_lines.dta{rm}
saved
{p_end}

{com}. restore
{txt}
{com}. 
. merge m:1 destination using temp_bart_lines, keep(master matched) generate(merge_destination)
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}       2,268,553{txt}  (merge_destination==3)
{col 5}{hline 41}

{com}. 
. // Check merge results
. drop if merge_destination == 2
{txt}(0 observations deleted)

{com}. drop merge_destination
{txt}
{com}. 
. // Clean up temporary file
. erase temp_bart_lines.dta
{txt}
{com}. 
. 
. **# 6. Create Needed Variables
. *******************************
. // Create Treatment Variable
. gen treated = ///
>         ((date >= origin_completion_date) & !missing(origin_completion_date)) | ///
>         ((date >= destination_completion_date) & !missing(destination_completion_date))
{txt}
{com}.         
. label variable treated "Either origin or destination post fare gate installment"
{txt}
{com}. 
. // Create Under Construction Variable
. gen under_construction = ///
>     ((date < origin_completion_date) & (date >= origin_start_date) & !missing(origin_start_date)) | ///
>     ((date < destination_completion_date) & (date >= destination_start_date) & !missing(destination_start_date))
{txt}
{com}. 
. label variable under_construction "Either origin or destination fare gate under construction"
{txt}
{com}. 
. // Create station-specific post dummies
. levelsof origin, local(all_stations)
{res}{txt}`"12TH"' `"16TH"' `"19TH"' `"24TH"' `"ANTC"' `"ASHB"' `"BALB"' `"BAYF"' `"BERY"' `"CAST"' `"CIVC"' `"COLM"' `"COLS"' `"CONC"' `"DALY"' `"DBRK"' `"DELN"' `"DUBL"' `"EMBR"' `"FRMT"' `"FTVL"' `"GLEN"' `"HAYW"' `"LAFY"' `"LAKE"' `"MCAR"' `"MLBR"' `"MLPT"' `"MONT"' `"NBRK"' `"NCON"' `"OAKL"' `"ORIN"' `"PCTR"' `"PHIL"' `"PITT"' `"PLZA"' `"POWL"' `"RICH"' `"ROCK"' `"SANL"' `"SBRN"' `"SFIA"' `"SHAY"' `"SSAN"' `"UCTY"' `"WARM"' `"WCRK"' `"WDUB"' `"WOAK"'

{com}. 
. foreach station of local all_stations {c -(}
{txt}  2{com}.     sum origin_completion_date if origin == "`station'", meanonly
{txt}  3{com}.     local comp_date = r(mean)
{txt}  4{com}.     
.     if !missing(`comp_date') {c -(}
{txt}  5{com}.         gen post_`station' = (date >= `comp_date') & !missing(date)
{txt}  6{com}.         label variable post_`station' "Post completion for `station'"
{txt}  7{com}.     {c )-}
{txt}  8{com}. {c )-}
{txt}
{com}. 
. // Create time-to-treatment variable
. gen earliest_completion = min(origin_completion_date, destination_completion_date)
{txt}
{com}. gen time_to_treatment = date - earliest_completion
{txt}
{com}. drop earliest_completion
{txt}
{com}. label variable time_to_treatment "Days relative to fare gate completion"
{txt}
{com}. 
. // Create transfer necessary variable
. gen transfer_necessary = 1  // Assume transfer needed initially
{txt}
{com}. 
. // Check if origin and destination share any common line
. foreach line in RED YELLOW BLUE GREEN ORANGE AIRPORT {c -(}
{txt}  2{com}.     replace transfer_necessary = 0 if ///
>         strpos(origin_lines, "`line'") > 0 & ///
>         strpos(destination_lines, "`line'") > 0
{txt}  3{com}. {c )-}
{txt}(542,536 real changes made)
(425,011 real changes made)
(211,340 real changes made)
(243,879 real changes made)
(203,187 real changes made)
(916 real changes made)

{com}. 
. label variable transfer_necessary "Trip requires transfer between lines"
{txt}
{com}. 
. **# 7. Final Data Inspection & Save
. ************************************
. // Check the treatment variables
. tab treated

     {txt}Either {c |}
  origin or {c |}
destination {c |}
  post fare {c |}
       gate {c |}
installment {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}  1,745,424       76.94       76.94
{txt}          1 {c |}{res}    523,129       23.06      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}  2,268,553      100.00
{txt}
{com}. sum time_to_treatment, detail

            {txt}Days relative to fare gate completion
{hline 61}
      Percentiles      Smallest
 1%    {res}     -834           -978
{txt} 5%    {res}     -730           -977
{txt}10%    {res}     -652           -976       {txt}Obs         {res}  2,268,553
{txt}25%    {res}     -497           -975       {txt}Sum of wgt. {res}  2,268,553

{txt}50%    {res}     -255                      {txt}Mean          {res}-254.9261
                        {txt}Largest       Std. dev.     {res} 298.7012
{txt}75%    {res}      -19            583
{txt}90%    {res}      139            583       {txt}Variance      {res}  89222.4
{txt}95%    {res}      220            583       {txt}Skewness      {res} .0514925
{txt}99%    {res}      352            583       {txt}Kurtosis      {res} 2.200315
{txt}
{com}. 
. // Check a few treated stations
. list origin destination date treated under_construction transfer_necessary riders if inlist(origin, "EMBR", "CAST") & inrange(date, td(09jan2025), td(11jan2025)), noobs clean
{txt}
    {res}origin   desti~on        date   treated   under_~n   transf~y   riders {txt} 
    {res}  CAST       12TH   11jan2025         0          1          1        3 {txt} 
    {res}  EMBR       12TH   11jan2025         0          1          0      218 {txt} 
    {res}  CAST       12TH   10jan2025         0          1          1       18 {txt} 
    {res}  EMBR       12TH   10jan2025         0          1          0      409 {txt} 
    {res}  EMBR       12TH   09jan2025         0          1          0      551 {txt} 
    {res}  CAST       12TH   09jan2025         0          1          1       29 {txt} 
    {res}  CAST       16TH   09jan2025         1          0          0       33 {txt} 
    {res}  EMBR       16TH   10jan2025         1          1          0      336 {txt} 
    {res}  EMBR       16TH   11jan2025         1          1          0      233 {txt} 
    {res}  EMBR       16TH   09jan2025         1          1          0      488 {txt} 
    {res}  CAST       16TH   10jan2025         1          0          0       30 {txt} 
    {res}  CAST       16TH   11jan2025         1          0          0       13 {txt} 
    {res}  CAST       19TH   11jan2025         0          0          1        7 {txt} 
    {res}  EMBR       19TH   10jan2025         0          1          0      424 {txt} 
    {res}  CAST       19TH   09jan2025         0          0          1       21 {txt} 
    {res}  EMBR       19TH   09jan2025         0          1          0      650 {txt} 
    {res}  EMBR       19TH   11jan2025         0          1          0      242 {txt} 
    {res}  CAST       19TH   10jan2025         0          0          1       18 {txt} 
    {res}  EMBR       24TH   11jan2025         1          1          0      252 {txt} 
    {res}  EMBR       24TH   10jan2025         1          1          0      492 {txt} 
    {res}  EMBR       24TH   09jan2025         1          1          0      667 {txt} 
    {res}  CAST       24TH   10jan2025         1          0          0       13 {txt} 
    {res}  CAST       24TH   09jan2025         1          0          0       16 {txt} 
    {res}  CAST       24TH   11jan2025         1          0          0       19 {txt} 
    {res}  CAST       ANTC   10jan2025         1          0          1        2 {txt} 
    {res}  EMBR       ANTC   11jan2025         1          1          0       47 {txt} 
    {res}  EMBR       ANTC   09jan2025         1          1          0      200 {txt} 
    {res}  EMBR       ANTC   10jan2025         1          1          0      132 {txt} 
    {res}  CAST       ANTC   09jan2025         1          0          1        1 {txt} 
    {res}  CAST       ASHB   09jan2025         0          0          1        1 {txt} 
    {res}  EMBR       ASHB   10jan2025         0          1          0      129 {txt} 
    {res}  CAST       ASHB   10jan2025         0          0          1        4 {txt} 
    {res}  EMBR       ASHB   11jan2025         0          1          0       92 {txt} 
    {res}  CAST       ASHB   11jan2025         0          0          1        3 {txt} 
    {res}  EMBR       ASHB   09jan2025         0          1          0      244 {txt} 
    {res}  CAST       BALB   10jan2025         0          0          0        8 {txt} 
    {res}  EMBR       BALB   11jan2025         0          1          0      132 {txt} 
    {res}  CAST       BALB   11jan2025         0          0          0        1 {txt} 
    {res}  CAST       BALB   09jan2025         0          0          0        9 {txt} 
    {res}  EMBR       BALB   10jan2025         0          1          0      354 {txt} 
    {res}  EMBR       BALB   09jan2025         0          1          0      456 {txt} 
    {res}  CAST       BAYF   09jan2025         0          0          0       21 {txt} 
    {res}  CAST       BAYF   11jan2025         0          0          0       15 {txt} 
    {res}  CAST       BAYF   10jan2025         0          0          0       26 {txt} 
    {res}  EMBR       BAYF   09jan2025         0          1          0      271 {txt} 
    {res}  EMBR       BAYF   10jan2025         0          1          0      200 {txt} 
    {res}  EMBR       BAYF   11jan2025         0          1          0       97 {txt} 
    {res}  CAST       BERY   09jan2025         0          0          1        6 {txt} 
    {res}  EMBR       BERY   11jan2025         0          1          0       37 {txt} 
    {res}  EMBR       BERY   09jan2025         0          1          0      138 {txt} 
    {res}  EMBR       BERY   10jan2025         0          1          0       85 {txt} 
    {res}  CAST       BERY   10jan2025         0          0          1        4 {txt} 
    {res}  CAST       BERY   11jan2025         0          0          1        9 {txt} 
    {res}  EMBR       CAST   09jan2025         0          1          0      226 {txt} 
    {res}  EMBR       CAST   10jan2025         0          1          0      128 {txt} 
    {res}  CAST       CAST   11jan2025         0          0          0        7 {txt} 
    {res}  EMBR       CAST   11jan2025         0          1          0       61 {txt} 
    {res}  CAST       CAST   09jan2025         0          0          0        6 {txt} 
    {res}  CAST       CAST   10jan2025         0          0          0        7 {txt} 
    {res}  CAST       CIVC   10jan2025         1          0          0      103 {txt} 
    {res}  EMBR       CIVC   09jan2025         1          1          0      144 {txt} 
    {res}  CAST       CIVC   09jan2025         1          0          0      112 {txt} 
    {res}  EMBR       CIVC   10jan2025         1          1          0      123 {txt} 
    {res}  EMBR       CIVC   11jan2025         1          1          0       55 {txt} 
    {res}  CAST       CIVC   11jan2025         1          0          0       46 {txt} 
    {res}  CAST       COLM   09jan2025         0          0          1        3 {txt} 
    {res}  EMBR       COLM   11jan2025         0          1          0       33 {txt} 
    {res}  CAST       COLM   11jan2025         0          0          1        3 {txt} 
    {res}  CAST       COLM   10jan2025         0          0          1        2 {txt} 
    {res}  EMBR       COLM   09jan2025         0          1          0      234 {txt} 
    {res}  EMBR       COLM   10jan2025         0          1          0      141 {txt} 
    {res}  EMBR       COLS   11jan2025         1          1          0       73 {txt} 
    {res}  EMBR       COLS   09jan2025         1          1          0      151 {txt} 
    {res}  CAST       COLS   10jan2025         1          0          0       21 {txt} 
    {res}  CAST       COLS   09jan2025         1          0          0       29 {txt} 
    {res}  EMBR       COLS   10jan2025         1          1          0      142 {txt} 
    {res}  CAST       COLS   11jan2025         1          0          0        8 {txt} 
    {res}  EMBR       CONC   09jan2025         0          1          0      323 {txt} 
    {res}  EMBR       CONC   11jan2025         0          1          0      100 {txt} 
    {res}  CAST       CONC   11jan2025         0          0          1        4 {txt} 
    {res}  CAST       CONC   10jan2025         0          0          1        4 {txt} 
    {res}  CAST       CONC   09jan2025         0          0          1        3 {txt} 
    {res}  EMBR       CONC   10jan2025         0          1          0      200 {txt} 
    {res}  CAST       DALY   10jan2025         0          0          0       13 {txt} 
    {res}  EMBR       DALY   10jan2025         0          1          0      389 {txt} 
    {res}  EMBR       DALY   11jan2025         0          1          0      145 {txt} 
    {res}  CAST       DALY   09jan2025         0          0          0        8 {txt} 
    {res}  CAST       DALY   11jan2025         0          0          0       10 {txt} 
    {res}  EMBR       DALY   09jan2025         0          1          0      574 {txt} 
    {res}  EMBR       DBRK   09jan2025         0          1          0      344 {txt} 
    {res}  EMBR       DBRK   10jan2025         0          1          0      325 {txt} 
    {res}  CAST       DBRK   10jan2025         0          0          1       17 {txt} 
    {res}  CAST       DBRK   11jan2025         0          0          1       15 {txt} 
    {res}  EMBR       DBRK   11jan2025         0          1          0      279 {txt} 
    {res}  CAST       DBRK   09jan2025         0          0          1       14 {txt} 
    {res}  CAST       DELN   10jan2025         0          0          1        5 {txt} 
    {res}  EMBR       DELN   11jan2025         0          1          0      159 {txt} 
    {res}  EMBR       DELN   09jan2025         0          1          0      398 {txt} 
    {res}  EMBR       DELN   10jan2025         0          1          0      311 {txt} 
    {res}  CAST       DELN   09jan2025         0          0          1        5 {txt} 
    {res}  CAST       DUBL   11jan2025         1          0          0       40 {txt} 
    {res}  EMBR       DUBL   10jan2025         1          1          0      376 {txt} 
    {res}  EMBR       DUBL   11jan2025         1          1          0      205 {txt} 
    {res}  EMBR       DUBL   09jan2025         1          1          0      702 {txt} 
    {res}  CAST       DUBL   09jan2025         1          0          0       57 {txt} 
    {res}  CAST       DUBL   10jan2025         1          0          0       51 {txt} 
    {res}  EMBR       EMBR   11jan2025         0          1          0      122 {txt} 
    {res}  EMBR       EMBR   09jan2025         0          1          0      122 {txt} 
    {res}  CAST       EMBR   11jan2025         0          1          0       60 {txt} 
    {res}  CAST       EMBR   09jan2025         0          1          0      257 {txt} 
    {res}  EMBR       EMBR   10jan2025         0          1          0      152 {txt} 
    {res}  CAST       EMBR   10jan2025         0          1          0      153 {txt} 
    {res}  CAST       FRMT   10jan2025         0          0          1       15 {txt} 
    {res}  CAST       FRMT   09jan2025         0          0          1       17 {txt} 
    {res}  EMBR       FRMT   11jan2025         0          1          0      117 {txt} 
    {res}  CAST       FRMT   11jan2025         0          0          1       10 {txt} 
    {res}  EMBR       FRMT   09jan2025         0          1          0      288 {txt} 
    {res}  EMBR       FRMT   10jan2025         0          1          0      154 {txt} 
    {res}  CAST       FTVL   09jan2025         1          0          0       32 {txt} 
    {res}  EMBR       FTVL   11jan2025         1          1          0      142 {txt} 
    {res}  CAST       FTVL   10jan2025         1          0          0       43 {txt} 
    {res}  EMBR       FTVL   10jan2025         1          1          0      298 {txt} 
    {res}  CAST       FTVL   11jan2025         1          0          0       28 {txt} 
    {res}  EMBR       FTVL   09jan2025         1          1          0      398 {txt} 
    {res}  CAST       GLEN   11jan2025         0          0          0        6 {txt} 
    {res}  EMBR       GLEN   11jan2025         0          1          0      123 {txt} 
    {res}  CAST       GLEN   10jan2025         0          0          0       12 {txt} 
    {res}  EMBR       GLEN   09jan2025         0          1          0      502 {txt} 
    {res}  EMBR       GLEN   10jan2025         0          1          0      305 {txt} 
    {res}  CAST       GLEN   09jan2025         0          0          0        8 {txt} 
    {res}  EMBR       HAYW   11jan2025         1          1          0       69 {txt} 
    {res}  EMBR       HAYW   09jan2025         1          1          0      165 {txt} 
    {res}  CAST       HAYW   11jan2025         1          0          1        6 {txt} 
    {res}  CAST       HAYW   09jan2025         1          0          1        8 {txt} 
    {res}  EMBR       HAYW   10jan2025         1          1          0      117 {txt} 
    {res}  CAST       HAYW   10jan2025         1          0          1        9 {txt} 
    {res}  EMBR       LAFY   10jan2025         0          1          0      228 {txt} 
    {res}  EMBR       LAFY   11jan2025         0          1          0      101 {txt} 
    {res}  EMBR       LAFY   09jan2025         0          1          0      437 {txt} 
    {res}  EMBR       LAKE   11jan2025         0          1          0      152 {txt} 
    {res}  CAST       LAKE   09jan2025         0          0          0       58 {txt} 
    {res}  CAST       LAKE   11jan2025         0          0          0       27 {txt} 
    {res}  CAST       LAKE   10jan2025         0          0          0       45 {txt} 
    {res}  EMBR       LAKE   10jan2025         0          1          0      236 {txt} 
    {res}  EMBR       LAKE   09jan2025         0          1          0      338 {txt} 
    {res}  EMBR       MCAR   09jan2025         0          1          0      563 {txt} 
    {res}  EMBR       MCAR   10jan2025         0          1          0      341 {txt} 
    {res}  EMBR       MCAR   11jan2025         0          1          0      218 {txt} 
    {res}  CAST       MCAR   09jan2025         0          0          1       11 {txt} 
    {res}  CAST       MCAR   10jan2025         0          0          1        5 {txt} 
    {res}  CAST       MCAR   11jan2025         0          0          1        4 {txt} 
    {res}  CAST       MLBR   09jan2025         0          0          1        3 {txt} 
    {res}  CAST       MLBR   10jan2025         0          0          1        3 {txt} 
    {res}  EMBR       MLBR   11jan2025         0          1          0       71 {txt} 
    {res}  EMBR       MLBR   09jan2025         0          1          0      171 {txt} 
    {res}  EMBR       MLBR   10jan2025         0          1          0       89 {txt} 
    {res}  CAST       MLPT   11jan2025         0          0          1        4 {txt} 
    {res}  EMBR       MLPT   11jan2025         0          1          0       29 {txt} 
    {res}  CAST       MLPT   09jan2025         0          0          1        6 {txt} 
    {res}  EMBR       MLPT   10jan2025         0          1          0       61 {txt} 
    {res}  EMBR       MLPT   09jan2025         0          1          0      109 {txt} 
    {res}  CAST       MLPT   10jan2025         0          0          1        5 {txt} 
    {res}  EMBR       MONT   11jan2025         1          1          0       25 {txt} 
    {res}  CAST       MONT   11jan2025         1          0          0       59 {txt} 
    {res}  EMBR       MONT   10jan2025         1          1          0       31 {txt} 
    {res}  CAST       MONT   10jan2025         1          0          0      121 {txt} 
    {res}  EMBR       MONT   09jan2025         1          1          0       26 {txt} 
    {res}  CAST       MONT   09jan2025         1          0          0      197 {txt} 
    {res}  EMBR       NBRK   10jan2025         0          1          0      204 {txt} 
    {res}  CAST       NBRK   10jan2025         0          0          1        1 {txt} 
    {res}  EMBR       NBRK   09jan2025         0          1          0      332 {txt} 
    {res}  EMBR       NBRK   11jan2025         0          1          0      143 {txt} 
    {res}  CAST       NBRK   09jan2025         0          0          1        2 {txt} 
    {res}  CAST       NBRK   11jan2025         0          0          1        1 {txt} 
    {res}  EMBR       NCON   10jan2025         0          1          0       47 {txt} 
    {res}  EMBR       NCON   09jan2025         0          1          0       83 {txt} 
    {res}  EMBR       NCON   11jan2025         0          1          0       21 {txt} 
    {res}  CAST       NCON   10jan2025         0          0          1        2 {txt} 
    {res}  EMBR       OAKL   11jan2025         1          1          1       15 {txt} 
    {res}  CAST       OAKL   10jan2025         1          0          1        1 {txt} 
    {res}  EMBR       OAKL   09jan2025         1          1          1       46 {txt} 
    {res}  EMBR       OAKL   10jan2025         1          1          1       26 {txt} 
    {res}  CAST       OAKL   09jan2025         1          0          1        2 {txt} 
    {res}  CAST       OAKL   11jan2025         1          0          1        1 {txt} 
    {res}  EMBR       ORIN   10jan2025         0          1          0      183 {txt} 
    {res}  EMBR       ORIN   11jan2025         0          1          0       88 {txt} 
    {res}  EMBR       ORIN   09jan2025         0          1          0      431 {txt} 
    {res}  CAST       ORIN   10jan2025         0          0          1        2 {txt} 
    {res}  CAST       PCTR   09jan2025         0          0          1        1 {txt} 
    {res}  EMBR       PCTR   10jan2025         0          1          0       25 {txt} 
    {res}  EMBR       PCTR   11jan2025         0          1          0        8 {txt} 
    {res}  EMBR       PCTR   09jan2025         0          1          0       31 {txt} 
    {res}  CAST       PHIL   09jan2025         0          0          1        4 {txt} 
    {res}  EMBR       PHIL   09jan2025         0          1          0      551 {txt} 
    {res}  CAST       PHIL   10jan2025         0          0          1        2 {txt} 
    {res}  CAST       PHIL   11jan2025         0          0          1        2 {txt} 
    {res}  EMBR       PHIL   10jan2025         0          1          0      313 {txt} 
    {res}  EMBR       PHIL   11jan2025         0          1          0      138 {txt} 
    {res}  CAST       PITT   10jan2025         0          0          1        1 {txt} 
    {res}  EMBR       PITT   09jan2025         0          1          0      267 {txt} 
    {res}  EMBR       PITT   10jan2025         0          1          0      188 {txt} 
    {res}  EMBR       PITT   11jan2025         0          1          0       56 {txt} 
    {res}  CAST       PITT   09jan2025         0          0          1        2 {txt} 
    {res}  CAST       PITT   11jan2025         0          0          1        2 {txt} 
    {res}  EMBR       PLZA   11jan2025         0          1          0       93 {txt} 
    {res}  CAST       PLZA   11jan2025         0          0          1        2 {txt} 
    {res}  CAST       PLZA   10jan2025         0          0          1       11 {txt} 
    {res}  EMBR       PLZA   09jan2025         0          1          0      278 {txt} 
    {res}  EMBR       PLZA   10jan2025         0          1          0      184 {txt} 
    {res}  CAST       PLZA   09jan2025         0          0          1        1 {txt} 
    {res}  CAST       POWL   10jan2025         1          0          0       95 {txt} 
    {res}  CAST       POWL   09jan2025         1          0          0       96 {txt} 
    {res}  EMBR       POWL   09jan2025         1          1          0      136 {txt} 
    {res}  EMBR       POWL   11jan2025         1          1          0       63 {txt} 
    {res}  CAST       POWL   11jan2025         1          0          0       76 {txt} 
    {res}  EMBR       POWL   10jan2025         1          1          0      115 {txt} 
    {res}  EMBR       RICH   09jan2025         1          1          0      219 {txt} 
    {res}  EMBR       RICH   10jan2025         1          1          0      193 {txt} 
    {res}  CAST       RICH   09jan2025         1          0          1        3 {txt} 
    {res}  EMBR       RICH   11jan2025         1          1          0       61 {txt} 
    {res}  CAST       RICH   10jan2025         1          0          1        2 {txt} 
    {res}  CAST       RICH   11jan2025         1          0          1        3 {txt} 
    {res}  EMBR       ROCK   10jan2025         0          1          0      333 {txt} 
    {res}  CAST       ROCK   11jan2025         0          0          1        2 {txt} 
    {res}  CAST       ROCK   09jan2025         0          0          1        3 {txt} 
    {res}  CAST       ROCK   10jan2025         0          0          1        1 {txt} 
    {res}  EMBR       ROCK   09jan2025         0          1          0      616 {txt} 
    {res}  EMBR       ROCK   11jan2025         0          1          0      212 {txt} 
    {res}  EMBR       SANL   09jan2025         0          1          0      370 {txt} 
    {res}  EMBR       SANL   11jan2025         0          1          0      108 {txt} 
    {res}  CAST       SANL   09jan2025         0          0          0       29 {txt} 
    {res}  CAST       SANL   10jan2025         0          0          0       36 {txt} 
    {res}  CAST       SANL   11jan2025         0          0          0       21 {txt} 
    {res}  EMBR       SANL   10jan2025         0          1          0      239 {txt} 
    {res}  CAST       SBRN   09jan2025         0          0          1        1 {txt} 
    {res}  EMBR       SBRN   10jan2025         0          1          0      106 {txt} 
    {res}  EMBR       SBRN   09jan2025         0          1          0      157 {txt} 
    {res}  CAST       SBRN   10jan2025         0          0          1        3 {txt} 
    {res}  EMBR       SBRN   11jan2025         0          1          0       46 {txt} 
    {res}  CAST       SBRN   11jan2025         0          0          1        2 {txt} 
    {res}  EMBR       SFIA   10jan2025         1          1          0      140 {txt} 
    {res}  CAST       SFIA   11jan2025         1          0          1        3 {txt} 
    {res}  CAST       SFIA   09jan2025         1          0          1        4 {txt} 
    {res}  EMBR       SFIA   11jan2025         1          1          0      106 {txt} 
    {res}  CAST       SFIA   10jan2025         1          0          1       11 {txt} 
    {res}  EMBR       SFIA   09jan2025         1          1          0      160 {txt} 
    {res}  EMBR       SHAY   11jan2025         1          1          0       63 {txt} 
    {res}  CAST       SHAY   09jan2025         0          1          1       14 {txt} 
    {res}  EMBR       SHAY   09jan2025         0          1          0      131 {txt} 
    {res}  CAST       SHAY   11jan2025         1          0          1        6 {txt} 
    {res}  CAST       SHAY   10jan2025         1          0          1       11 {txt} 
    {res}  EMBR       SHAY   10jan2025         1          1          0       74 {txt} 
    {res}  CAST       SSAN   09jan2025         0          0          1        1 {txt} 
    {res}  EMBR       SSAN   11jan2025         0          1          0       37 {txt} 
    {res}  CAST       SSAN   11jan2025         0          0          1        4 {txt} 
    {res}  EMBR       SSAN   10jan2025         0          1          0      100 {txt} 
    {res}  CAST       SSAN   10jan2025         0          0          1        3 {txt} 
    {res}  EMBR       SSAN   09jan2025         0          1          0      180 {txt} 
    {res}  EMBR       UCTY   11jan2025         0          1          0       65 {txt} 
    {res}  CAST       UCTY   10jan2025         0          0          1       10 {txt} 
    {res}  CAST       UCTY   11jan2025         0          0          1        7 {txt} 
    {res}  EMBR       UCTY   10jan2025         0          1          0      129 {txt} 
    {res}  EMBR       UCTY   09jan2025         0          1          0      217 {txt} 
    {res}  CAST       UCTY   09jan2025         0          0          1       11 {txt} 
    {res}  CAST       WARM   09jan2025         1          0          1        8 {txt} 
    {res}  CAST       WARM   10jan2025         1          0          1        3 {txt} 
    {res}  EMBR       WARM   09jan2025         1          1          0      117 {txt} 
    {res}  EMBR       WARM   10jan2025         1          1          0       49 {txt} 
    {res}  CAST       WARM   11jan2025         1          0          1        1 {txt} 
    {res}  EMBR       WARM   11jan2025         1          1          0       39 {txt} 
    {res}  CAST       WCRK   09jan2025         0          0          1        2 {txt} 
    {res}  EMBR       WCRK   09jan2025         0          1          0      600 {txt} 
    {res}  EMBR       WCRK   10jan2025         0          1          0      292 {txt} 
    {res}  CAST       WCRK   10jan2025         0          0          1        3 {txt} 
    {res}  EMBR       WCRK   11jan2025         0          1          0      195 {txt} 
    {res}  EMBR       WDUB   11jan2025         0          1          0       73 {txt} 
    {res}  CAST       WDUB   11jan2025         0          0          0       53 {txt} 
    {res}  CAST       WDUB   09jan2025         0          0          0       39 {txt} 
    {res}  EMBR       WDUB   10jan2025         0          1          0      151 {txt} 
    {res}  EMBR       WDUB   09jan2025         0          1          0      307 {txt} 
    {res}  CAST       WDUB   10jan2025         0          0          0       38 {txt} 
    {res}  EMBR       WOAK   09jan2025         1          1          0      883 {txt} 
    {res}  CAST       WOAK   09jan2025         1          0          0        7 {txt} 
    {res}  EMBR       WOAK   10jan2025         1          1          0      600 {txt} 
    {res}  CAST       WOAK   10jan2025         1          0          0        5 {txt} 
    {res}  CAST       WOAK   11jan2025         1          0          0        6 {txt} 
    {res}  EMBR       WOAK   11jan2025         1          1          0      347 {txt} 

{com}. 
. // Save the final dataset
. save "bart_ridership_2023_2025_with_treatment.dta", replace
{txt}{p 0 4 2}
file {bf}
bart_ridership_2023_2025_with_treatment.dta{rm}
saved
{p_end}

{com}. 
. // Close the log file
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/austincoffelt/Documents/bart_fare_gates_project/results/analysis_log_ 8 Sep 2025.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 8 Sep 2025, 20:44:17
{txt}{.-}
{smcl}
{txt}{sf}{ul off}